import random
sm=[] # λιστα με τα ονόματα των SM
timi=[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]] # ορισμός της λίστας με τις τιμές ανά SM και προϊόν

imera=["Δευτέρα","Τρίτη","Τεταρτη","Πέμπτη","Παρασκευή","Σαββάτο"] # λίστα με τις εργάσιμες ημέρες της εβδομάδας
mt=[] # λίστα με τις εβδομάδιαίες μέσες τιμές ανά SM

# εισαγωγή δεδομένων
# εισαγωγή των ονομάτων των SM
for i in range(4):
    onoma=input("Δωσε το όνομα του SM: ")
    sm.append(onoma)
# εισαγωγή της τιμής για κάθε SM και για κάθε ημέρα της εβδομάδας
for i in range(4): # για κάθε μία από τις 4 λίστες της λίστας timi
    for j in range(6): # για κάθε στοιχείο της καθε μιας από τις 4 λίστες
        # διαμόρφωση του μηνύματος στο χρήστη
        print('Για το SM {} δώσε την τιμή προιόντος την {}'.format(sm[i],imera[j]),end=":")
        timi[i][j]=random.randrange(170,200)
        #timi[i][j]=float(input("  ")) # εισαγωγή του στοιχείου
print("")
print("============================================")
# για κάθε SM υπολογίζει την μέση τιμή του προϊόντος στο τέλος της εβδομάδας
# και καταχωρεί το αποτέλεσμα στη λίστα mt
for i in range(4):
    sum=0
    for j in range(6):
        sum+=timi[i][j]
        mesi=sum/6
        mt.append(mesi)
        
# για κάθε SM εμφανίζει τη μέση τιμή του προϊόντος στο τέλος της εβδομάδας
for i in range(4):
    print("SM:",sm[i],format(mt[i],'.3f'))
      
fthino=min(mt) # βρίσκει τη φθηνότερη μέση τιμή
thesi=mt.index(fthino) # βρίσκει τη θέση στη λίστα που αντιστοιχεί στη φθηνότερη μέση τιμή

print("Tο φθηνότερο είναι το SM:",sm[thesi])

sum=0
for i in range(4):
    sum+=mt[i]
mesi=sum/4
print("H μέση εβδομαδιαία τιμή του προϊόντος ειναι:",format(mesi,'.3f'))



